export const JOURNEYS_DATA = [
  {
   id: 1,
    slug: "الأوراس",
    title: "انتفاضة الاوراس ",
    subtitle: "أهم الثورات الشعبية الجزائرية",
    year: "1916",
    region: "الأوراس",
    type: "ثورة",
    description: "تُعدّ انتفاضة الأوراس سنة 1916 من أهم الثورات الشعبية الجزائرية ضد الاستعمار الفرنسي رغم تهميشها في التاريخ الرسمي والمناهج الدراسية وقد اندلعت بسبب تدهور الأوضاع الاجتماعية والاقتصادية وانتشار الفقر والمجاعات والأوبئة إضافة إلى القوانين الاستعمارية الجائرة مثل قانون الأهالي والتجنيد الإجباري سنة 1912 إلى جانب مصادرة أراضي السكان لصالح المعمرين الأوروبيين بدأت الثورة ليلة 11 إلى 12 نوفمبر 1916 بقيادة الثائر “بن نوي” من خلال مهاجمة برج عين التوتة وقتل مسؤولين فرنسيين ثم امتدت بسرعة إلى مختلف مناطق الأوراس بقيادة عدد من الثوار المحليين الذين استهدفوا الإدارة الاستعمارية ومزارع المعمرين وخاضوا معارك مهمة أبرزها معركة جبل مستاوا وقد واجهت فرنسا الانتفاضة بعنف شديد ففرضت النظام العسكري وارتكبت جرائم جماعية شملت الاعتقالات والمحاكمات والسجن والغرامات ومصادرة الممتلكات والأسلحة والمواشي وتميزت انتفاضة 1916 بأنها أول ثورة شعبية جزائرية لا تقودها الزوايا والطرق الدينية كما شهدت ظهور شعار “استقلال الجزائر” لأول مرة لذلك يعتبرها المؤرخون محطة بارزة في تاريخ المقاومة الوطنية الجزائرية.",
    image: "image/oures.jpg",
    //audio: "https://www.soundjay.com/nature/wind-01.mp3",
    related: [2, 3],
    sources: [
      "كتاب تحفة الزائر في تاريخ الجزائر",
      "الأرشيف الوطني الجزائري"
    ],
    details: [
      { label: "السنة", value: "1916" },
      { label: "المكان", value: "الأوراس" },
      { label: "الحدث", value: "انتفاضة الاوراس" }
    ]
  },
  {
    id: 5,
    slug: "المظاهرات",
    title: "مظاهرات 11 ديسمبر 1960",
    subtitle: "تقرير مصير القضية الجزائرية",
    year: "1960",
    region: "الجزائر",
    type: "مظاهرات",
    description: "شهدت عدة مدن مظاهرات شعبية واسعة عبّرت عن التأييد للاستقلال بمشاركة مختلف فئات المجتمع، وأسفرت عن سقوط ضحايا مدنيين ووقوع مواجهات مع قوات الأمن، كما ساهمت في تأكيد الطابع الشعبي الشامل للثورة وتعزيز الموقف السياسي للوفد الجزائري في المفاوضات.",
    image: "image/wow2.jpg",
    //audio: "https://www.soundjay.com/nature/wind-01.mp3",
    related: [3, 2 ,1],
    sources: ["سجلات جيش التحرير الوطني"],
    details: [
      { label: "السنة", value: "1960" },
      { label: "المكان", value: "الجزائر و مدن الشمال" },
      { label: "النتيجة", value: "نصر معنوي وعسكري كبير" }
    ]
  },
  {
    id: 2,
    slug: "مجازر 8 ماي 1945",
    title: "مجازر 8 ماي 1945",
    subtitle: "سطيف , قالمة , خراطة",
    year: "1945",
    region: "سطيف",
    type: "مجازر",
    description: "شهدت مدن الشرق الجزائري مظاهرات سلمية بعد الحرب العالمية الثانية مطالبة بالحقوق السياسية وحق تقرير المصير وفي سطيف أدى إطلاق النار إلى تصعيد تلاه قمع واسع امتد إلى المناطق الريفية سقط عشرات الآلاف من الجزائريين ووقعت اعتقالات جماعية وتدمير للقرى والممتلكات",
    image: "image/Majazir.jpg",
    audio: "voc/vocale1.mp3",
    related: [3, 4],
    sources: ["مذكرات المجاهدين", "شهادات حية من القصبة"],
    details: [
      { label: "السنة", value: "1945" },
      { label: "المكان", value: " قاملة , خراطة ,سطيف" },
      { label: "النوع", value: "مجازر" }
    ]
  },
  {
   id: 3,
    slug: "الهجمات",
    title: "هجمات 20 أوت 1955",
    subtitle: "سلسلة عمليات عسكرية استراتيجية",
    year: "1955",
    region: "كافة التراب الوطني",
    type: "ثورة",
    active: true,
    description: "عمليات هجومية متزامنة استهدفت مواقع عسكرية وإدارية بهدف توسيع نطاق الثورة وتخفيف الضغط عن مناطق أخرى، بمشاركة المجاهدين والمدنيين ضمن تعبئة شعبية، وقد أسفرت عن ضحايا جزائريين بأعداد كبيرة نتيجة القمع والانتقام، إضافة إلى خسائر بشرية ومادية في صفوف القوات الاستعمارية واعتقالات وتدمير ممتلكات، وبرز فيها كل من زيغود يوسف وديدوش مراد، وأسهمت في توسيع الطابع الشعبي للثورة ولفت الانتباه الدولي للقضية الجزائرية.",
    image: "image/attack.jpg",
   // audio: "voc/20aout.mp3",
    related: [1, 2, 5],
    sources: [,"ارشيف الثورة التحريرية"],
    details: [
      { label: "السنة", value: "1955" },
      { label: "المكان", value: "الجزائر (كل المناطق)" },
      { label: "القادة", value: "مجموعة الستة" }
    ]
  },
  {
    id: 4,
    slug: "القمع",
    title: "تصاعد القمع والإعدامات (1954–1956)",
    subtitle: "التصعيد في القمع",
    year: "1956",
    region: "تلمسان",
    type: "قمع",
    description: "عقب اندلاع الثورة التحريرية كثّفت السلطات الاستعمارية إجراءاتها الأمنية في الغرب الجزائري عبر الاعتقالات والمحاكمات والإعدامات للحد من انتشار النشاط الثوري، ما أدى إلى إعدام وسجن عدد من المناضلين وفرض تضييق أمني واسع على السكان مع تسجيل حالات تعذيب وانتهاكات، وبرز أحمد زبانة كأحد أهم الشخصيات، وأسهمت هذه الممارسات في تصاعد التعاطف الشعبي مع الثورة واتساع رقعة الانخراط في العمل المسلح.",
    image: "image/wow.jpg",
   // audio: "https://www.soundjay.com/nature/wind-01.mp3",
    related: [3, 5],
    sources: ["الأرشيف الدبلوماسي"],
    details: [
      { label: "السنة", value: "1956" },
      { label: "المكان", value: "تلمسان، وهران، معسكر" },
      { label: "النتيجة", value: "تدويل القضية الجزائرية" }
    ]
  }
];
